spec/fixtures/vcr_cassettes/ChartMogul_SubscriptionEvent/API_interactions/deletes_the_subscription_event.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.chartmogul.com/v1/data_sources
    body:
      encoding: UTF-8
      string: '{"name":"Subscription Events Test ds_destroy"}'
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Fri, 27 May 2022 21:54:14 GMT
      status:
      - 201 Created
      content-length:
      - '173'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37","name":"Subscription
        Events Test ds_destroy","system":"Import API","created_at":"2022-05-27T21:54:14.203Z","status":"idle"}'
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:14 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"external_id":"test_cus_ext_id","name":"Test Customer","data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37"}'
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Fri, 27 May 2022 21:54:14 GMT
      status:
      - 201 Created
      content-length:
      - '772'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"id":131944242,"uuid":"cus_8c92c01a-de07-11ec-bf89-8f7ace0c0ebe","external_id":"test_cus_ext_id","name":"Test
        Customer","email":"","status":"Lead","customer-since":null,"attributes":{"custom":{},"clearbit":{},"stripe":{},"tags":[]},"data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37","data_source_uuids":["ds_8c554802-de07-11ec-94f4-e390518bbd37"],"external_ids":["test_cus_ext_id"],"company":"","country":null,"state":null,"city":"","zip":null,"lead_created_at":null,"free_trial_started_at":null,"address":{"country":null,"state":null,"city":"","address_zip":null},"mrr":0,"arr":0,"billing-system-url":null,"chartmogul-url":"https://app.chartmogul.com/#/customers/131944242-Test_Customer","billing-system-type":"Import
        API","currency":"USD","currency-sign":"$"}'
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:14 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/plans
    body:
      encoding: UTF-8
      string: '{"name":"Test Plan1","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37"}'
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 27 May 2022 21:54:15 GMT
      etag:
      - W/"0b21f0d75302a76373931e37ba429605"
      referrer-policy:
      - strict-origin-when-cross-origin
      status:
      - 201 Created
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 59f66274d33c71993c6b7cd9f65f8860
      x-runtime:
      - '0.051109'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '225'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"external_id":"795139e0-c035-013a-9407-0a902fab83ca","name":"Test
        Plan1","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37","uuid":"pl_795139e0-c035-013a-9407-0a902fab83ca"}'
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:14 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/subscription_events
    body:
      encoding: UTF-8
      string: '{"subscription_event":{"id":null,"data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37","customer_external_id":"test_cus_ext_id","subscription_set_external_id":"","subscription_external_id":"test_cus_sub_ext_id1","plan_external_id":"","event_date":"2022-05-18T09:48:34Z","effective_date":"2021-12-30T00:01:00Z","event_type":"subscription_cancelled","external_id":"test_ev_id_delete_1","errors":null,"created_at":null,"updated_at":null,"quantity":"","currency":"","amount_in_cents":"","tax_amount_in_cents":null,"retracted_event_id":null}}'
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 27 May 2022 21:54:15 GMT
      etag:
      - W/"48983256e3214afc451392183977f77c"
      referrer-policy:
      - strict-origin-when-cross-origin
      status:
      - 201 Created
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - ca47cfb422d6e4a87151532b8aa7675a
      x-runtime:
      - '0.037850'
      x-xss-protection:
      - 1; mode=block
      transfer-encoding:
      - chunked
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"id":138979493,"data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37","customer_external_id":"test_cus_ext_id","subscription_set_external_id":"","subscription_external_id":"test_cus_sub_ext_id1","plan_external_id":"","event_date":"2022-05-18T09:48:34Z","effective_date":"2021-12-30T00:01:00Z","event_type":"subscription_cancelled","external_id":"test_ev_id_delete_1","errors":{},"created_at":"2022-05-27T21:54:15Z","updated_at":"2022-05-27T21:54:15Z","quantity":"","currency":"","amount_in_cents":"","tax_amount_in_cents":null,"retracted_event_id":null}'
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:15 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/subscription_events?data_source_uuid=ds_8c554802-de07-11ec-94f4-e390518bbd37
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 27 May 2022 21:54:15 GMT
      etag:
      - W/"791982e0cdffb65af28f52d42bd5f9e7"
      referrer-policy:
      - strict-origin-when-cross-origin
      status:
      - 200 OK
      vary:
      - Accept-Encoding, Accept-Encoding
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - ebb9192eae76cafbf22ff48c7af22dbb
      x-runtime:
      - '0.019523'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '370'
      connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"subscription_events":[{"id":138979493,"data_source_uuid":"ds_8c554802-de07-11ec-94f4-e390518bbd37","customer_external_id":"test_cus_ext_id","subscription_set_external_id":"","subscription_external_id":"test_cus_sub_ext_id1","plan_external_id":"","event_date":"2022-05-18T09:48:34Z","effective_date":"2021-12-30T00:01:00Z","event_type":"subscription_cancelled","external_id":"test_ev_id_delete_1","errors":{},"created_at":"2022-05-27T21:54:15Z","updated_at":"2022-05-27T21:54:15Z","quantity":"","currency":"","amount_in_cents":"","tax_amount_in_cents":null,"retracted_event_id":null}],"meta":{"next_key":null,"prev_key":null,"before_key":"2022-05-27T21:54:15.757Z","page":1,"total_pages":1}}'
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:15 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/subscription_events?subscription_event%5Bid%5D=138979493
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - no-cache
      date:
      - Fri, 27 May 2022 21:54:16 GMT
      referrer-policy:
      - strict-origin-when-cross-origin
      status:
      - 204 No Content
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 3cbc09f8a06ab202da93ff02c5ee7329
      x-runtime:
      - '0.031820'
      x-xss-protection:
      - 1; mode=block
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:16 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/subscription_events?data_source_uuid=ds_8c554802-de07-11ec-94f4-e390518bbd37
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 27 May 2022 21:54:16 GMT
      etag:
      - W/"4ec30e9c0f35ab5620b71cf7987ad1e8"
      referrer-policy:
      - strict-origin-when-cross-origin
      status:
      - 200 OK
      vary:
      - Accept-Encoding, Accept-Encoding
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - f4d118fc0613d489065d9d7cb6517dae
      x-runtime:
      - '0.013635'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '130'
      connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: '{"subscription_events":[],"meta":{"next_key":null,"prev_key":null,"before_key":"2022-05-27T21:54:16.462Z","page":0,"total_pages":0}}'
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:16 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/data_sources/ds_8c554802-de07-11ec-94f4-e390518bbd37
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.0.0
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      access-control-allow-credentials:
      - 'true'
      date:
      - Fri, 27 May 2022 21:54:16 GMT
      status:
      - 204 No Content
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Fri, 27 May 2022 21:54:16 GMT
recorded_with: VCR 5.1.0
