fixtures/vcr_cassettes/ChartMogul_SubscriptionEvent/API_interactions/deletes_the_subscription_event.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.chartmogul.com/v1/data_sources
    body:
      encoding: UTF-8
      string: '{"name":"Subscription Events Test ds_destroy"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Thu, 14 Sep 2023 00:25:35 GMT
      content-length:
      - '173'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59","name":"Subscription
        Events Test ds_destroy","system":"Import API","created_at":"2023-09-14T00:25:35.492Z","status":"idle"}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:35 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"external_id":"test_cus_ext_id","name":"Test Customer","data_source_uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      content-type:
      - application/json
      date:
      - Thu, 14 Sep 2023 00:25:35 GMT
      content-length:
      - '791'
      connection:
      - keep-alive
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        eyJpZCI6MTE5Mzk2MjA2LCJ1dWlkIjoiY3VzXzM5M2NhY2VjLTUyOTUtMTFlZS05NTZlLTlmZGZjNDcyZWIxMyIsImV4dGVybmFsX2lkIjoidGVzdF9jdXNfZXh0X2lkIiwibmFtZSI6IlRlc3QgQ3VzdG9tZXIiLCJlbWFpbCI6IiIsInN0YXR1cyI6Ik5ldyBMZWFkIiwiY3VzdG9tZXItc2luY2UiOm51bGwsImF0dHJpYnV0ZXMiOnsiY3VzdG9tIjp7fSwiY2xlYXJiaXQiOnt9LCJzdHJpcGUiOnt9LCJ0YWdzIjpbXX0sImRhdGFfc291cmNlX3V1aWQiOiJkc18zOTA1ZDJkMC01Mjk1LTExZWUtYjU1ZS1lYjE1NmExZTlkNTkiLCJkYXRhX3NvdXJjZV91dWlkcyI6WyJkc18zOTA1ZDJkMC01Mjk1LTExZWUtYjU1ZS1lYjE1NmExZTlkNTkiXSwiZXh0ZXJuYWxfaWRzIjpbInRlc3RfY3VzX2V4dF9pZCJdLCJjb21wYW55IjoiIiwiY291bnRyeSI6bnVsbCwic3RhdGUiOm51bGwsImNpdHkiOiIiLCJ6aXAiOm51bGwsImxlYWRfY3JlYXRlZF9hdCI6bnVsbCwiZnJlZV90cmlhbF9zdGFydGVkX2F0IjpudWxsLCJhZGRyZXNzIjp7ImNvdW50cnkiOm51bGwsInN0YXRlIjpudWxsLCJjaXR5IjoiIiwiYWRkcmVzc196aXAiOm51bGx9LCJtcnIiOjAsImFyciI6MCwiYmlsbGluZy1zeXN0ZW0tdXJsIjpudWxsLCJjaGFydG1vZ3VsLXVybCI6Imh0dHBzOi8vYXBwLmNoYXJ0bW9ndWwuY29tLyMvY3VzdG9tZXJzLzExOTM5NjIwNi1UZXN0X0N1c3RvbWVyIiwiYmlsbGluZy1zeXN0ZW0tdHlwZSI6IkltcG9ydCBBUEkiLCJjdXJyZW5jeSI6IkVVUiIsImN1cnJlbmN5LXNpZ24iOiLigqwiLCJvd25lciI6bnVsbH0=
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:35 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/plans
    body:
      encoding: UTF-8
      string: '{"name":"Test Plan1","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:25:36 GMT
      etag:
      - W/"f12dd3b10a817c4b39248c1ca36b0ad6"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - e7106773d580136078ac20bf4a878d29
      x-runtime:
      - '0.057821'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '225'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"external_id":"25ed7270-34c3-013c-9c8f-027103c7ebee","name":"Test
        Plan1","interval_count":7,"interval_unit":"day","data_source_uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59","uuid":"pl_25ed7270-34c3-013c-9c8f-027103c7ebee"}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:36 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/subscription_events
    body:
      encoding: UTF-8
      string: '{"subscription_event":{"id":null,"data_source_uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59","customer_external_id":"test_cus_ext_id","subscription_set_external_id":"","subscription_external_id":"test_cus_sub_ext_id1","plan_external_id":"","event_date":"2022-05-18T09:48:34Z","effective_date":"2021-12-30T00:01:00Z","event_type":"subscription_cancelled","external_id":"test_ev_id_delete_1","errors":null,"created_at":null,"updated_at":null,"quantity":"","currency":"","amount_in_cents":"","tax_amount_in_cents":null,"retracted_event_id":null}}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:25:36 GMT
      etag:
      - W/"a0ed9d60c36f49c5f531dc71a58c2f46"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 19f429b3891664a804e0c88b7280c2b4
      x-runtime:
      - '0.068345'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '560'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"id":371091409,"data_source_uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59","customer_external_id":"test_cus_ext_id","subscription_set_external_id":"","subscription_external_id":"test_cus_sub_ext_id1","plan_external_id":"","event_date":"2022-05-18T09:48:34Z","effective_date":"2021-12-30T00:01:00Z","event_type":"subscription_cancelled","external_id":"test_ev_id_delete_1","errors":{},"created_at":"2023-09-14T00:25:36Z","updated_at":"2023-09-14T00:25:36Z","quantity":"","currency":"","amount_in_cents":"","tax_amount_in_cents":null,"retracted_event_id":null}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:36 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/subscription_events?data_source_uuid=ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:25:36 GMT
      etag:
      - W/"67d638e4d41cdc93e6c93d6e6200a4e1"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 802b6fb636b54ec1c83d49c658698994
      x-runtime:
      - '0.029144'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '777'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"subscription_events":[{"id":371091409,"data_source_uuid":"ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59","customer_external_id":"test_cus_ext_id","subscription_set_external_id":"","subscription_external_id":"test_cus_sub_ext_id1","plan_external_id":"","event_date":"2022-05-18T09:48:34Z","effective_date":"2021-12-30T00:01:00Z","event_type":"subscription_cancelled","external_id":"test_ev_id_delete_1","errors":{},"created_at":"2023-09-14T00:25:36Z","updated_at":"2023-09-14T00:25:36Z","quantity":"","currency":"","amount_in_cents":"","tax_amount_in_cents":null,"retracted_event_id":null}],"has_more":false,"cursor":"MjAyMy0wOS0xNFQwMDoyNTozNi41MTA1MjcwMDBaJjM3MTA5MTQwOQ=="}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:36 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/subscription_events?subscription_event%5Bid%5D=371091409
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - no-cache
      date:
      - Thu, 14 Sep 2023 00:25:37 GMT
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - dff7c61bbc8c44295ee36a3668be99f9
      x-runtime:
      - '0.059827'
      x-xss-protection:
      - 1; mode=block
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:37 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/subscription_events?data_source_uuid=ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Thu, 14 Sep 2023 00:25:37 GMT
      etag:
      - W/"042f13aa47f5f0f17727d638eb607f1a"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 4575a2a70b46c1da225e0761313f6fc2
      x-runtime:
      - '0.029279'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '163'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"subscription_events":[],"meta":{"next_key":null,"prev_key":null,"before_key":"2023-09-14T00:25:37.334Z","page":0,"total_pages":0,"has_more":false,"cursor":null}}'
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:37 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/data_sources/ds_3905d2d0-5295-11ee-b55e-eb156a1e9d59
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.0.0
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      access-control-allow-credentials:
      - 'true'
      date:
      - Thu, 14 Sep 2023 00:25:37 GMT
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Thu, 14 Sep 2023 00:25:37 GMT
recorded_with: VCR 5.1.0
