spec/fixtures/vcr_cassettes/ChartMogul_SubscriptionEvent/API_interactions/should_paginate_using_cursor_when_called_with_next.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.chartmogul.com/v1/subscription_events?customer_uuid=cus_713e32ae-74a1-11ee-b822-fbc804fece75&per_page=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 27 Oct 2023 11:15:58 GMT
      etag:
      - W/"12bad95caa37327853a1d9c7de804214"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - 2375869b84ba29c6546aee6f6c9baded
      x-runtime:
      - '0.037509'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '764'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"subscription_events":[{"id":374279754,"data_source_uuid":"ds_03cfd2c4-2c7e-11ee-ab23-cb0f008cff46","customer_external_id":"cus_001","subscription_set_external_id":null,"subscription_external_id":"1234","plan_external_id":"plan_Gold_monthly_1_month","event_date":"2023-09-30T23:00:00Z","effective_date":"2023-09-30T23:00:00Z","event_type":"subscription_start","external_id":null,"errors":{},"created_at":"2023-10-27T10:40:29Z","updated_at":"2023-10-27T10:40:29Z","quantity":1,"currency":"EUR","amount_in_cents":100,"tax_amount_in_cents":0,"retracted_event_id":null}],"meta":{"next_key":374279754,"prev_key":null,"before_key":"2023-10-27T11:15:58.538Z","page":1,"total_pages":15},"cursor":"MjAyMy0xMC0yN1QxMDo0MDoyOS4wNTE2NDMwMDBaJjM3NDI3OTc1NA==","has_more":true}'
    http_version:
  recorded_at: Fri, 27 Oct 2023 11:15:58 GMT
- request:
    method: get
    uri: https://api.chartmogul.com/v1/subscription_events?cursor=MjAyMy0xMC0yN1QxMDo0MDoyOS4wNTE2NDMwMDBaJjM3NDI3OTc1NA%3D%3D&customer_uuid=cus_713e32ae-74a1-11ee-b822-fbc804fece75&per_page=1
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/3.3.1
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 200
      message: OK
    headers:
      access-control-allow-credentials:
      - 'true'
      cache-control:
      - max-age=0, private, must-revalidate
      content-type:
      - application/json; charset=utf-8
      date:
      - Fri, 27 Oct 2023 11:15:58 GMT
      etag:
      - W/"9d6f3cf9a0c4c67756e6a6cf0372b6fb"
      referrer-policy:
      - strict-origin-when-cross-origin
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-frame-options:
      - DENY
      x-permitted-cross-domain-policies:
      - none
      x-request-id:
      - aa891b74b109670dd888d1324f6e086e
      x-runtime:
      - '0.023068'
      x-xss-protection:
      - 1; mode=block
      content-length:
      - '651'
      connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"subscription_events":[{"id":374279751,"data_source_uuid":"ds_03cfd2c4-2c7e-11ee-ab23-cb0f008cff46","customer_external_id":"cus_001","subscription_set_external_id":null,"subscription_external_id":"123","plan_external_id":"plan_Gold_annual_1_year","event_date":"2023-10-26T23:00:00Z","effective_date":"2023-10-26T23:00:00Z","event_type":"subscription_start","external_id":null,"errors":{},"created_at":"2023-10-27T10:39:30Z","updated_at":"2023-10-27T10:39:30Z","quantity":1,"currency":"EUR","amount_in_cents":11100,"tax_amount_in_cents":0,"retracted_event_id":null}],"cursor":"MjAyMy0xMC0yN1QxMDozOTozMC43NTgxMzQwMDBaJjM3NDI3OTc1MQ==","has_more":true}'
    http_version:
  recorded_at: Fri, 27 Oct 2023 11:15:58 GMT
recorded_with: VCR 5.1.0
